//--------------------------------------【程序说明】-------------------------------------------
//		程序说明：《OpenCV3编程入门》OpenCV3版书本配套示例程序04
//		程序描述：使用blur函数进行基于均值滤波的图像模糊操作
//		开发测试所用操作系统： Windows 10 64bit
//		开发测试所用IDE版本：Visual Studio 2013
//		开发测试所用OpenCV版本：	3.1.0
//		2017年6月 Created by Xchen
//		2017年6月 Revised by Xchen
//------------------------------------------------------------------------------------------------


//---------------------------------【头文件、命名空间包含部分】---------------------------
//		描述：包含程序所使用的头文件和命名空间
//-----------------------------------------------------------------------------------------------
#include "opencv2/highgui/highgui.hpp" 
#include "opencv2/imgproc/imgproc.hpp" 
using namespace cv; 

//-----------------------------------【main( )函数】--------------------------------------------
//		描述：控制台应用程序的入口函数，我们的程序从这里开始
//-----------------------------------------------------------------------------------------------
int main()
{ 
	//【1】载入原始图
	Mat srcImage=imread("1.jpg"); 
	//【2】显示原始图
	imshow( "均值滤波【原图】", srcImage ); 
	//【3】进行均值滤波操作
	Mat dstImage; 
	blur( srcImage, dstImage, Size(17, 17)); 
	//【4】显示效果图
	imshow( "均值滤波【效果图】" ,dstImage ); 
	imwrite("对称均值滤波.jpg", dstImage);
	waitKey( 0 );     
} 